---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures
source: html/9a53db23-f09e-8bb7-5574-abeb470b9db7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures

Failures about DimensionFailures.

## Syntax (C#)
```csharp
public static class DimensionFailures
```